Tekla Open API Reference for Tekla Structures 2025
InvalidCurveCombinationException Class
 This class represent an exception thrown when the combination of base curves is not allowed in a lofted plate operation
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.LoftedPlateOperationException
 Tekla.Structures.Model.InvalidCurveCombinationException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class InvalidCurveCombinationException : LoftedPlateOperationException
Public Class InvalidCurveCombinationException
	Inherits LoftedPlateOperationException
The InvalidCurveCombinationException type exposes the following members.
Constructors
Name | Description
InvalidCurveCombinationException
 Constructs an instance of the class
Top
See Also
Reference
Tekla.Structures.Model Namespace